OpenNuvoton/ISPTool/Firmwares/NUC029FAE_BSP/Library/Device/Nuvoton/NUC029FAE/Include/NUC029FAE.h
#define SYS_RSTSRC_RSTS_BOD_Pos                 4                                       /*!< SYS RSTSRC: RSTS_BOD Position  */
#define SYS_RSTSRC_RSTS_BOD_Msk                 (1ul << SYS_RSTSRC_RSTS_BOD_Pos)        /*!< SYS RSTSRC: RSTS_BOD Mask      */

#define SYS_RSTSRC_RSTS_WDT_Pos                 2                                       /*!< SYS RSTSRC: RSTS_WDT Position  */
#define SYS_RSTSRC_RSTS_WDT_Msk                 (1ul << SYS_RSTSRC_RSTS_WDT_Pos)        /*!< SYS RSTSRC: RSTS_WDT Mask      */

#define SYS_RSTSRC_RSTS_RESET_Pos               1                                       /*!< SYS RSTSRC: RSTS_RESET Position    */
#define SYS_RSTSRC_RSTS_RESET_Msk               (1ul << SYS_RSTSRC_RSTS_RESET_Pos)      /*!< SYS RSTSRC: RSTS_RESET Mask        */

#define SYS_RSTSRC_RSTS_POR_Pos                 0                                       /*!< SYS RSTSRC: RSTS_POR Position  */
#define SYS_RSTSRC_RSTS_POR_Msk                 (1ul << SYS_RSTSRC_RSTS_POR_Pos)        /*!< SYS RSTSRC: RSTS_POR Mask      */

/* SYS IPRSTC1 Bit Field Definitions */
#define SYS_IPRSTC1_CPU_RST_Pos                 1                                       /*!< SYS IPRSTC1: CPU_RST Position  */
#define SYS_IPRSTC1_CPU_RST_Msk                 (1ul << SYS_IPRSTC1_CPU_RST_Pos)        /*!< SYS IPRSTC1: CPU_RST Mask      */

#define SYS_IPRSTC1_CHIP_RST_Pos                0                                       /*!< SYS IPRSTC1: CHIP_RST Position */
#define SYS_IPRSTC1_CHIP_RST_Msk                (1ul << SYS_IPRSTC1_CHIP_RST_Pos)       /*!< SYS IPRSTC1: CHIP_RST Mask     */

/* SYS IPRSTC2 Bit Field Definitions */
#define SYS_IPRSTC2_ADC_RST_Pos                 28                                      /*!< SYS IPRSTC2: ADC_RST Position  */
#define SYS_IPRSTC2_ADC_RST_Msk                 (1ul << SYS_IPRSTC2_ADC_RST_Pos)        /*!< SYS IPRSTC2: ADC_RST Mask      */

#define SYS_IPRSTC2_ACMP_RST_Pos                22                                      /*!< SYS IPRSTC2: ACMP_RST Position */
#define SYS_IPRSTC2_ACMP_RST_Msk                (1ul << SYS_IPRSTC2_ACMP_RST_Pos)       /*!< SYS IPRSTC2: ACMP_RST Mask     */

#define SYS_IPRSTC2_PWM_RST_Pos                 20                                      /*!< SYS IPRSTC2: PWM_RST Position  */
#define SYS_IPRSTC2_PWM_RST_Msk                 (1ul << SYS_IPRSTC2_PWM_RST_Pos)        /*!< SYS IPRSTC2: PWM_RST Mask      */

#define SYS_IPRSTC2_UART_RST_Pos                16                                      /*!< SYS IPRSTC2: UART_RST Position */
#define SYS_IPRSTC2_UART_RST_Msk                (1ul << SYS_IPRSTC2_UART_RST_Pos)       /*!< SYS IPRSTC2: UART_RST Mask     */

#define SYS_IPRSTC2_SPI_RST_Pos                 12                                      /*!< SYS IPRSTC2: SPI_RST Position  */
#define SYS_IPRSTC2_SPI_RST_Msk                 (1ul << SYS_IPRSTC2_SPI_RST_Pos)        /*!< SYS IPRSTC2: SPI_RST Mask      */

#define SYS_IPRSTC2_I2C_RST_Pos                 8                                       /*!< SYS IPRSTC2: I2C_RST Position  */
#define SYS_IPRSTC2_I2C_RST_Msk                 (1ul << SYS_IPRSTC2_I2C_RST_Pos)        /*!< SYS IPRSTC2: I2C_RST Mask      */

#define SYS_IPRSTC2_TMR1_RST_Pos                3                                       /*!< SYS IPRSTC2: TMR1_RST Position */
#define SYS_IPRSTC2_TMR1_RST_Msk                (1ul << SYS_IPRSTC2_TMR1_RST_Pos)       /*!< SYS IPRSTC2: TMR1_RST Mask     */

#define SYS_IPRSTC2_TMR0_RST_Pos                2                                       /*!< SYS IPRSTC2: TMR0_RST Position */
#define SYS_IPRSTC2_TMR0_RST_Msk                (1ul << SYS_IPRSTC2_TMR0_RST_Pos)       /*!< SYS IPRSTC2: TMR0_RST Mask     */

#define SYS_IPRSTC2_GPIO_RST_Pos                1                                       /*!< SYS IPRSTC2: GPIO_RST Position */
#define SYS_IPRSTC2_GPIO_RST_Msk                (1ul << SYS_IPRSTC2_GPIO_RST_Pos)       /*!< SYS IPRSTC2: GPIO_RST Mask     */

/* SYS BODCR Bit Field Definitions */
#define SYS_BODCR_BOD_OUT_Pos                   6                                       /*!< SYS BODCR: BOD_OUT Position    */
#define SYS_BODCR_BOD_OUT_Msk                   (1ul << SYS_BODCR_BOD_OUT_Pos)          /*!< SYS BODCR: BOD_OUT Mask        */

#define SYS_BODCR_BOD_LPM_Pos                  5                                        /*!< SYS BODCR: BOD_LPM Position    */
#define SYS_BODCR_BOD_LPM_Msk                  (1ul << SYS_BODCR_BOD_LPM_Pos)           /*!< SYS BODCR: BOD_LPM Mask        */

#define SYS_BODCR_BOD_INTF_Pos                  4                                       /*!< SYS BODCR: BOD_INTF Position   */
#define SYS_BODCR_BOD_INTF_Msk                  (1ul << SYS_BODCR_BOD_INTF_Pos)         /*!< SYS BODCR: BOD_INTF Mask       */

#define SYS_BODCR_BOD_RSTEN_Pos                 3                                       /*!< SYS BODCR: BOD_RSTEN Position  */
#define SYS_BODCR_BOD_RSTEN_Msk                 (1ul << SYS_BODCR_BOD_RSTEN_Pos)        /*!< SYS BODCR: BOD_RSTEN Mask      */

#define SYS_BODCR_BOD_VL_Pos                    1                                       /*!< SYS BODCR: BOD_VL Position     */
#define SYS_BODCR_BOD_VL_Msk                    (3ul << SYS_BODCR_BOD_VL_Pos)           /*!< SYS BODCR: BOD_VL Mask         */

#define SYS_BODCR_BOD_VL_EXT_Pos                0                                       /*!< SYS BODCR: BOD_VL_EXT Position */
#define SYS_BODCR_BOD_VL_EXT_Msk                (1ul << SYS_BODCR_BOD_VL_EXT_Pos)       /*!< SYS BODCR: BOD_VL_EXT Mask     */

/* SYS P0_MFP Bit Field Definitions */
#define SYS_P0_MFP_P0_TYPE_Pos                  16                                      /*!< SYS P0_MFP: P0_TYPE Position   */
#define SYS_P0_MFP_P0_TYPE_Msk                  (0xFFul << SYS_P0_MFP_P0_TYPE_Pos)      /*!< SYS P0_MFP: P0_TYPE Mask       */

#define SYS_P0_MFP_P0_ALT_Pos                   8                                       /*!< SYS P0_MFP: P0_ALT Position    */
#define SYS_P0_MFP_P0_ALT_Msk                   (0xFFul << SYS_P0_MFP_P0_ALT_Pos)       /*!< SYS P0_MFP: P0_ALT Mask        */

#define SYS_P0_MFP_P0_MFP_Pos                   0                                       /*!< SYS P0_MFP: P0_MFP Position    */
#define SYS_P0_MFP_P0_MFP_Msk                   (0xFFul << SYS_P0_MFP_P0_MFP_Pos)       /*!< SYS P0_MFP: P0_MFP Mask        */

/* SYS P1_MFP Bit Field Definitions */
#define SYS_P1_MFP_P1_TYPE_Pos                  16                                      /*!< SYS P1_MFP: P1_TYPE Position   */
#define SYS_P1_MFP_P1_TYPE_Msk                  (0xFFul << SYS_P1_MFP_P1_TYPE_Pos)      /*!< SYS P1_MFP: P1_TYPE Mask       */

#define SYS_P1_MFP_P1_ALT_Pos                   8                                       /*!< SYS P1_MFP: P1_ALT Position    */
#define SYS_P1_MFP_P1_ALT_Msk                   (0xFFul << SYS_P1_MFP_P1_ALT_Pos)       /*!< SYS P1_MFP: P1_ALT Mask        */

#define SYS_P1_MFP_P1_MFP_Pos                   0                                       /*!< SYS P1_MFP: P1_MFP Position    */
#define SYS_P1_MFP_P1_MFP_Msk                   (0xFFul << SYS_P1_MFP_P1_MFP_Pos)       /*!< SYS P1_MFP: P1_MFP Mask        */

/* SYS P2_MFP Bit Field Definitions */
#define SYS_P2_MFP_P2_TYPE_Pos                  16                                      /*!< SYS P2_MFP: P2_TYPE Position   */
#define SYS_P2_MFP_P2_TYPE_Msk                  (0xFFul << SYS_P2_MFP_P2_TYPE_Pos)      /*!< SYS P2_MFP: P2_TYPE Mask       */

