OpenNuvoton/ISPTool/Firmwares/NUC029FAE_BSP/Library/Device/Nuvoton/NUC029FAE/Include/NUC029FAE.h
#define SYS_P2_MFP_P2_ALT_Pos                   8                                       /*!< SYS P2_MFP: P2_ALT Position    */
#define SYS_P2_MFP_P2_ALT_Msk                   (0xFFul << SYS_P2_MFP_P2_ALT_Pos)       /*!< SYS P2_MFP: P2_ALT Mask        */

#define SYS_P2_MFP_P2_MFP_Pos                   0                                       /*!< SYS P2_MFP: P2_MFP Position    */
#define SYS_P2_MFP_P2_MFP_Msk                   (0xFFul << SYS_P2_MFP_P2_MFP_Pos)       /*!< SYS P2_MFP: P2_MFP Mask        */

/* SYS P3_MFP Bit Field Definitions */
#define SYS_P3_MFP_P3_TYPE_Pos                  16                                      /*!< SYS P3_MFP: P3_TYPE Position   */
#define SYS_P3_MFP_P3_TYPE_Msk                  (0xFFul << SYS_P3_MFP_P3_TYPE_Pos)      /*!< SYS P3_MFP: P3_TYPE Mask       */

#define SYS_P3_MFP_P3_ALT_Pos                   8                                       /*!< SYS P3_MFP: P3_ALT Position    */
#define SYS_P3_MFP_P3_ALT_Msk                   (0xFFul << SYS_P3_MFP_P3_ALT_Pos)       /*!< SYS P3_MFP: P3_ALT Mask        */

#define SYS_P3_MFP_P3_MFP_Pos                   0                                       /*!< SYS P3_MFP: P3_MFP Position    */
#define SYS_P3_MFP_P3_MFP_Msk                   (0xFFul << SYS_P3_MFP_P3_MFP_Pos)       /*!< SYS P3_MFP: P3_MFP Mask        */

/* SYS P4_MFP Bit Field Definitions */
#define SYS_P4_MFP_P4_TYPE_Pos                  16                                      /*!< SYS P4_MFP: P4_TYPE Position   */
#define SYS_P4_MFP_P4_TYPE_Msk                  (0xFFul << SYS_P4_MFP_P4_TYPE_Pos)      /*!< SYS P4_MFP: P4_TYPE Mask       */

#define SYS_P4_MFP_P4_ALT_Pos                   8                                       /*!< SYS P4_MFP: P4_ALT Position    */
#define SYS_P4_MFP_P4_ALT_Msk                   (0xFFul << SYS_P4_MFP_P4_ALT_Pos)       /*!< SYS P4_MFP: P4_ALT Mask        */

#define SYS_P4_MFP_P4_MFP_Pos                   0                                       /*!< SYS P4_MFP: P4_MFP Position    */
#define SYS_P4_MFP_P4_MFP_Msk                   (0xFFul << SYS_P4_MFP_P4_MFP_Pos)       /*!< SYS P4_MFP: P4_MFP Mask        */

/* SYS P5_MFP Bit Field Definitions */
#define SYS_P5_MFP_P5_TYPE_Pos                  16                                      /*!< SYS P5_MFP: P5_TYPE Position   */
#define SYS_P5_MFP_P5_TYPE_Msk                  (0xFFul << SYS_P5_MFP_P5_TYPE_Pos)      /*!< SYS P5_MFP: P5_TYPE Mask       */

#define SYS_P5_MFP_P5_ALT_Pos                   8                                       /*!< SYS P5_MFP: P5_ALT Position    */
#define SYS_P5_MFP_P5_ALT_Msk                   (0xFFul << SYS_P5_MFP_P5_ALT_Pos)       /*!< SYS P5_MFP: P5_ALT Mask        */

#define SYS_P5_MFP_P5_MFP_Pos                   0                                       /*!< SYS P5_MFP: P5_MFP Position    */
#define SYS_P5_MFP_P5_MFP_Msk                   (0xFFul << SYS_P5_MFP_P5_MFP_Pos)       /*!< SYS P5_MFP: P5_MFP Mask        */

/* SYS IRCTRIMCTL Bit Field Definitions */
#define SYS_IRCTRIMCTL_TRIM_LOOP_Pos            3                                       /*!< SYS IRCTRIMCTL: TRIM_LOOP Position */
#define SYS_IRCTRIMCTL_TRIM_LOOP_Msk            (0x3ul << SYS_IRCTRIMCTL_TRIM_LOOP_Pos) /*!< SYS IRCTRIMCTL: TRIM_LOOP Mask     */

#define SYS_IRCTRIMCTL_TRIM_SEL_Pos             0                                       /*!< SYS IRCTRIMCTL: TRIM_SEL Position  */
#define SYS_IRCTRIMCTL_TRIM_SEL_Msk             (0x1ul << SYS_IRCTRIMCTL_TRIM_SEL_Pos)  /*!< SYS IRCTRIMCTL: TRIM_SEL Mask      */

/* SYS IRCTRIMIEN Bit Field Definitions */
#define SYS_IRCTRIMIEN_32K_ERR_IEN_Pos          2                                         /*!< SYS IRCTRIMIEN: 32K_ERR_IEN Position     */
#define SYS_IRCTRIMIEN_32K_ERR_IEN_Msk          (0x1ul << SYS_IRCTRIMIEN_32K_ERR_IEN_Pos) /*!< SYS IRCTRIMIEN: 32K_ERR_IEN Mask         */

#define SYS_IRCTRIMIEN_TRIM_FAIL_IEN_Pos        1                                         /*!< SYS IRCTRIMIEN: TRIM_FAIL_IEN Position   */
#define SYS_IRCTRIMIEN_TRIM_FAIL_IEN_Msk        (0x1ul << SYS_IRCTRIMIEN_TRIM_FAIL_IEN_Pos)/*!< SYS IRCTRIMIEN: TRIM_FAIL_IEN Mask      */

/* SYS IRCTRIMINT Bit Field Definitions */
#define SYS_IRCTRIMINT_32K_ERR_INT_Pos          2                                         /*!< SYS IRCTRIMINT: 32K_ERR_INT Position */
#define SYS_IRCTRIMINT_32K_ERR_INT_Msk          (0x1ul << SYS_IRCTRIMINT_32K_ERR_IEN_Pos) /*!< SYS IRCTRIMINT: 32K_ERR_INT Mask     */

#define SYS_IRCTRIMINT_TRIM_FAIL_INT_Pos        1                                         /*!< SYS IRCTRIMINT: TRIM_FAIL_INT Position   */
#define SYS_IRCTRIMINT_TRIM_FAIL_INT_Msk        (0x1ul << SYS_IRCTRIMINT_TRIM_FAIL_IEN_Pos)/*!< SYS IRCTRIMINT: TRIM_FAIL_INT Mask      */

#define SYS_IRCTRIMINT_FREQ_LOCK_Pos            0                                         /*!< SYS IRCTRIMINT: FREQ_LOCK Position   */
#define SYS_IRCTRIMINT_FREQ_LOCK_Msk            (0x1ul << SYS_IRCTRIMINT_FREQ_LOCK_Pos)   /*!< SYS IRCTRIMINT: FREQ_LOCK Mask       */

/* SYS RegLockAddr Bit Field Definitions */
#define SYS_RegLockAddr_RegUnLock_Pos           0                                         /*!< SYS RegLockAddr: RegUnLock Position  */
#define SYS_RegLockAddr_RegUnLock_Msk           (0x1ul << SYS_RegLockAddr_RegUnLock_Pos)  /*!< SYS RegLockAddr: RegUnLock Mask      */
/// @endcond /* HIDDEN_SYMBOLS */
/*@}*/ /* end of group SYS */



/*----------------------------- Timer Controller -----------------------------*/
/** @addtogroup TIMER Timer Controller(TIMER)
  Memory Mapped Structure for TIMER Controller
  @{
 */

typedef struct
{
    __IO uint32_t  TCSR;       /*!< Offset: 0x0000   Timer Control and Status Register          */
    __IO uint32_t  TCMPR;      /*!< Offset: 0x0004   Timer Compare Register                     */
    __IO uint32_t  TISR;       /*!< Offset: 0x0008   Timer Interrupt Status Register            */
    __I  uint32_t  TDR;        /*!< Offset: 0x000C   Timer Data Register                        */
    __I  uint32_t  TCAP;       /*!< Offset: 0x0010   Timer Capture Data Register                */
    __IO uint32_t  TEXCON;     /*!< Offset: 0x0014   Timer External Control Register            */
    __IO uint32_t  TEXISR;     /*!< Offset: 0x0018   Timer External Interrupt Status Register   */
} TIMER_T;
/// @cond HIDDEN_SYMBOLS
/* TIMER TCSR Bit Field Definitions */
#define TIMER_TCSR_DBGACK_TMR_Pos   31                                          /*!< TIMER TCSR: DBGACK_TMR Position    */
#define TIMER_TCSR_DBGACK_TMR_Msk   (1ul << TIMER_TCSR_DBGACK_TMR_Pos)          /*!< TIMER TCSR: DBGACK_TMR Mask        */

